#language: ru
@1
  Функционал: Поиск на авито
    Сценарий: Найдем самые дорогие принтеры на авито
      Пусть  открыт ресурс авито
      И в выпадающем списке категорий выбрана Оргтехника и расходники
      И в поле поиска введено значение принтер
      Тогда кликнуть по выпадающему списку региона
      Тогда в поле регион введено значение Владивосток
      И нажата кнопка показать объявления
      И активирован чекбокс только с доставкой
      И в выпадающем списке сортировка выбрано значение Дороже
      И в консоль выведено значение названия и цены 3 первых товаров